Revit 2024 API
SharedParameterElement.GuidValue Property
 The Guid that identifies this shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public Guid GuidValue { get; }
Visual Basic
Public ReadOnly Property GuidValue As Guid
	Get
Visual C++
public:
property Guid GuidValue {
	Guid get ();
}
See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace